zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XRDC_B.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_XRDC_B.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_XRDC_B
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_XRDC_B_H_)  /* Check if memory map has not been already included */
#define S32K566_XRDC_B_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- XRDC_B Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XRDC_B_Peripheral_Access_Layer XRDC_B Peripheral Access Layer
 * @{
 */

/** XRDC_B - Size of Registers Arrays */
#define XRDC_B_MDAC_COUNT                         14u
#define XRDC_B_MRC_COUNT                          9u
#define XRDC_B_DERRLOC_COUNT                      16u
#define XRDC_B_DERRW0_COUNT                       22u
#define XRDC_B_PID_COUNT                          14u
#define XRDC_B_PDACN0_COUNT                       101u
#define XRDC_B_PDACN1_COUNT                       118u
#define XRDC_B_PDACN2_COUNT                       127u
#define XRDC_B_PDACN3_COUNT                       83u
#define XRDC_B_MRCN_COUNT                         9u
#define XRDC_B_MRCN_MRGDN_COUNT                   16u
#define XRDC_B_PDACN4_COUNT                       107u
#define XRDC_B_PDACN5_COUNT                       112u

/** XRDC_B - Register Layout Typedef */
typedef struct XRDC_B_Struct {
  __IO uint32_t CR;                                /**< Control, offset: 0x0 */
  uint8_t RESERVED_0[236];
  __I  uint32_t HWCFG0;                            /**< Hardware Configuration 0, offset: 0xF0 */
  __I  uint32_t HWCFG1;                            /**< Hardware Configuration 1, offset: 0xF4 */
  __I  uint32_t HWCFG2;                            /**< Hardware Configuration 2, offset: 0xF8 */
  uint8_t RESERVED_1[4];
  __I  uint8_t MDACFG[XRDC_B_MDAC_COUNT];          /**< Master Domain Assignment Configuration, array offset: 0x100, array step: 0x1 */
  uint8_t RESERVED_2[50];
  __I  uint8_t MRCFG[XRDC_B_MRC_COUNT];            /**< Memory Region Configuration, array offset: 0x140, array step: 0x1 */
  uint8_t RESERVED_3[183];
  __I  uint32_t DERRLOC[XRDC_B_DERRLOC_COUNT];     /**< Domain Error Location, array offset: 0x200, array step: 0x4 */
  uint8_t RESERVED_4[448];
  struct XRDC_B_DERRW0 {                           /* offset: 0x400, array step: 0x10 */
    __I  uint32_t DERR_W0;                           /**< Domain Error Word 0, array offset: 0x400, array step: 0x10, valid indices: [0-8, 16-21] */
    __I  uint32_t DERR_W1;                           /**< Domain Error Word 1, array offset: 0x404, array step: 0x10, valid indices: [0-8, 16-21] */
    uint8_t RESERVED_0[4];
    __IO uint32_t DERR_W3;                           /**< Domain Error Word 3, array offset: 0x40C, array step: 0x10, valid indices: [0-8, 16-21] */
  } DERRW0[XRDC_B_DERRW0_COUNT];
  uint8_t RESERVED_5[416];
  __IO uint32_t PID[XRDC_B_PID_COUNT];             /**< Process Identifier, array offset: 0x700, array step: 0x4, valid indices: [0-3, 7-8, 12-13] */
  uint8_t RESERVED_6[200];
  __IO uint32_t MDA_W0_0_DFMT0;                    /**< Master Domain Assignment, offset: 0x800 */
  __IO uint32_t MDA_W1_0_DFMT0;                    /**< Master Domain Assignment, offset: 0x804 */
  __IO uint32_t MDA_W2_0_DFMT0;                    /**< Master Domain Assignment, offset: 0x808 */
  __IO uint32_t MDA_W3_0_DFMT0;                    /**< Master Domain Assignment, offset: 0x80C */
  uint8_t RESERVED_7[16];
  __IO uint32_t MDA_W0_1_DFMT0;                    /**< Master Domain Assignment, offset: 0x820 */
  __IO uint32_t MDA_W1_1_DFMT0;                    /**< Master Domain Assignment, offset: 0x824 */
  __IO uint32_t MDA_W2_1_DFMT0;                    /**< Master Domain Assignment, offset: 0x828 */
  __IO uint32_t MDA_W3_1_DFMT0;                    /**< Master Domain Assignment, offset: 0x82C */
  uint8_t RESERVED_8[16];
  __IO uint32_t MDA_W0_2_DFMT0;                    /**< Master Domain Assignment, offset: 0x840 */
  __IO uint32_t MDA_W1_2_DFMT0;                    /**< Master Domain Assignment, offset: 0x844 */
  __IO uint32_t MDA_W2_2_DFMT0;                    /**< Master Domain Assignment, offset: 0x848 */
  __IO uint32_t MDA_W3_2_DFMT0;                    /**< Master Domain Assignment, offset: 0x84C */
  uint8_t RESERVED_9[16];
  __IO uint32_t MDA_W0_3_DFMT0;                    /**< Master Domain Assignment, offset: 0x860 */
  __IO uint32_t MDA_W1_3_DFMT0;                    /**< Master Domain Assignment, offset: 0x864 */
  __IO uint32_t MDA_W2_3_DFMT0;                    /**< Master Domain Assignment, offset: 0x868 */
  __IO uint32_t MDA_W3_3_DFMT0;                    /**< Master Domain Assignment, offset: 0x86C */
  uint8_t RESERVED_10[16];
  __IO uint32_t MDA_W0_4_DFMT1;                    /**< Master Domain Assignment, offset: 0x880 */
  uint8_t RESERVED_11[28];
  __IO uint32_t MDA_W0_5_DFMT1;                    /**< Master Domain Assignment, offset: 0x8A0 */
  uint8_t RESERVED_12[28];
  __IO uint32_t MDA_W0_6_DFMT1;                    /**< Master Domain Assignment, offset: 0x8C0 */
  uint8_t RESERVED_13[28];
  __IO uint32_t MDA_W0_7_DFMT0;                    /**< Master Domain Assignment, offset: 0x8E0 */
  __IO uint32_t MDA_W1_7_DFMT0;                    /**< Master Domain Assignment, offset: 0x8E4 */
  __IO uint32_t MDA_W2_7_DFMT0;                    /**< Master Domain Assignment, offset: 0x8E8 */
  __IO uint32_t MDA_W3_7_DFMT0;                    /**< Master Domain Assignment, offset: 0x8EC */
  uint8_t RESERVED_14[16];
  __IO uint32_t MDA_W0_8_DFMT0;                    /**< Master Domain Assignment, offset: 0x900 */
  __IO uint32_t MDA_W1_8_DFMT0;                    /**< Master Domain Assignment, offset: 0x904 */
  __IO uint32_t MDA_W2_8_DFMT0;                    /**< Master Domain Assignment, offset: 0x908 */
  __IO uint32_t MDA_W3_8_DFMT0;                    /**< Master Domain Assignment, offset: 0x90C */
  uint8_t RESERVED_15[16];
  __IO uint32_t MDA_W0_9_DFMT1;                    /**< Master Domain Assignment, offset: 0x920 */
  uint8_t RESERVED_16[28];
  __IO uint32_t MDA_W0_10_DFMT1;                   /**< Master Domain Assignment, offset: 0x940 */
  uint8_t RESERVED_17[28];
  __IO uint32_t MDA_W0_11_DFMT1;                   /**< Master Domain Assignment, offset: 0x960 */
  uint8_t RESERVED_18[28];
  __IO uint32_t MDA_W0_12_DFMT0;                   /**< Master Domain Assignment, offset: 0x980 */
  __IO uint32_t MDA_W1_12_DFMT0;                   /**< Master Domain Assignment, offset: 0x984 */
  __IO uint32_t MDA_W2_12_DFMT0;                   /**< Master Domain Assignment, offset: 0x988 */
  __IO uint32_t MDA_W3_12_DFMT0;                   /**< Master Domain Assignment, offset: 0x98C */
  uint8_t RESERVED_19[16];
  __IO uint32_t MDA_W0_13_DFMT0;                   /**< Master Domain Assignment, offset: 0x9A0 */
  __IO uint32_t MDA_W1_13_DFMT0;                   /**< Master Domain Assignment, offset: 0x9A4 */
  __IO uint32_t MDA_W2_13_DFMT0;                   /**< Master Domain Assignment, offset: 0x9A8 */
  __IO uint32_t MDA_W3_13_DFMT0;                   /**< Master Domain Assignment, offset: 0x9AC */
  uint8_t RESERVED_20[1616];
  struct XRDC_B_PDACN0 {                           /* offset: 0x1000, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x1000, array step: 0x8, valid indices: [3, 23-36, 41, 50, 56-100] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x1004, array step: 0x8, valid indices: [3, 23-36, 41, 50, 56-100] */
  } PDACN0[XRDC_B_PDACN0_COUNT];
  uint8_t RESERVED_21[216];
  struct XRDC_B_PDACN1 {                           /* offset: 0x1400, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x1400, array step: 0x8, valid indices: [4-5, 7, 9, 11, 13, 15, 17, 19, 21, 37, 101-117] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x1404, array step: 0x8, valid indices: [4-5, 7, 9, 11, 13, 15, 17, 19, 21, 37, 101-117] */
  } PDACN1[XRDC_B_PDACN1_COUNT];
  uint8_t RESERVED_22[80];
  struct XRDC_B_PDACN2 {                           /* offset: 0x1800, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x1800, array step: 0x8, valid indices: [0-2, 22, 38-40, 42-43, 45-49, 51-52, 54-55, 122-124, 126] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x1804, array step: 0x8, valid indices: [0-2, 22, 38-40, 42-43, 45-49, 51-52, 54-55, 122-124, 126] */
  } PDACN2[XRDC_B_PDACN2_COUNT];
  uint8_t RESERVED_23[8];
  struct XRDC_B_PDACN3 {                           /* offset: 0x1C00, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x1C00, array step: 0x8, valid indices: [2-7, 26-69, 82] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x1C04, array step: 0x8, valid indices: [2-7, 26-69, 82] */
  } PDACN3[XRDC_B_PDACN3_COUNT];
  uint8_t RESERVED_24[360];
  struct XRDC_B_MRGDN {                            /* offset: 0x2000, array step: index*0x200, index2*0x20 */
    __IO uint32_t XRDC_MRGD_W0;                      /**< Memory Region Descriptor Word 0, array offset: 0x2000, array step: index*0x200, index2*0x20, valid indices: [0][0-15], [1][0-15], [2][0-15], [3][0-15], [4][0-7], [5][0-15], [6][0-15], [7][0-3], [8][0-15] */
    __IO uint32_t XRDC_MRGD_W1;                      /**< Memory Region Descriptor Word 1, array offset: 0x2004, array step: index*0x200, index2*0x20, valid indices: [0][0-15], [1][0-15], [2][0-15], [3][0-15], [4][0-7], [5][0-15], [6][0-15], [7][0-3], [8][0-15] */
    __IO uint32_t XRDC_MRGD_W2;                      /**< Memory Region Descriptor Word 2, array offset: 0x2008, array step: index*0x200, index2*0x20, valid indices: [0][0-15], [1][0-15], [2][0-15], [3][0-15], [4][0-7], [5][0-15], [6][0-15], [7][0-3], [8][0-15] */
    __IO uint32_t XRDC_MRGD_W3;                      /**< Memory Region Descriptor Word 3, array offset: 0x200C, array step: index*0x200, index2*0x20, valid indices: [0][0-15], [1][0-15], [2][0-15], [3][0-15], [4][0-7], [5][0-15], [6][0-15], [7][0-3], [8][0-15] */
    uint8_t RESERVED_0[16];
  } MRGDN[XRDC_B_MRCN_COUNT][XRDC_B_MRCN_MRGDN_COUNT];
  uint8_t RESERVED_25[3584];
  struct XRDC_B_PDACN4 {                           /* offset: 0x4000, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x4000, array step: 0x8, valid indices: [8, 10, 12, 14, 16, 18, 20, 22, 94-106] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x4004, array step: 0x8, valid indices: [8, 10, 12, 14, 16, 18, 20, 22, 94-106] */
  } PDACN4[XRDC_B_PDACN4_COUNT];
  uint8_t RESERVED_26[168];
  struct XRDC_B_PDACN5 {                           /* offset: 0x4400, array step: 0x8 */
    __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x4400, array step: 0x8, valid indices: [1, 24, 70-73, 76-81, 83-85, 87-88, 90-92, 107-111] */
    __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x4404, array step: 0x8, valid indices: [1, 24, 70-73, 76-81, 83-85, 87-88, 90-92, 107-111] */
  } PDACN5[XRDC_B_PDACN5_COUNT];
} XRDC_B_Type, *XRDC_B_MemMapPtr;

/** Number of instances of the XRDC_B module. */
#define XRDC_B_INSTANCE_COUNT                    (1u)

/* XRDC_B - Peripheral instance base addresses */
/** Peripheral XRDC_B base address */
#define IP_XRDC_B_BASE                           (0x40BB0000u)
/** Peripheral XRDC_B base pointer */
#define IP_XRDC_B                                ((XRDC_B_Type *)IP_XRDC_B_BASE)
/** Array initializer of XRDC_B peripheral base addresses */
#define IP_XRDC_B_BASE_ADDRS                     { IP_XRDC_B_BASE }
/** Array initializer of XRDC_B peripheral base pointers */
#define IP_XRDC_B_BASE_PTRS                      { IP_XRDC_B }

/* ----------------------------------------------------------------------------
   -- XRDC_B Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XRDC_B_Register_Masks XRDC_B Register Masks
 * @{
 */

