zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XRDC_B.h
/*! @name CR - Control */
/*! @{ */

#define XRDC_B_CR_GVLD_MASK                      (0x1U)
#define XRDC_B_CR_GVLD_SHIFT                     (0U)
#define XRDC_B_CR_GVLD_WIDTH                     (1U)
#define XRDC_B_CR_GVLD(x)                        (((uint32_t)(((uint32_t)(x)) << XRDC_B_CR_GVLD_SHIFT)) & XRDC_B_CR_GVLD_MASK)

#define XRDC_B_CR_HRL_MASK                       (0x1EU)
#define XRDC_B_CR_HRL_SHIFT                      (1U)
#define XRDC_B_CR_HRL_WIDTH                      (4U)
#define XRDC_B_CR_HRL(x)                         (((uint32_t)(((uint32_t)(x)) << XRDC_B_CR_HRL_SHIFT)) & XRDC_B_CR_HRL_MASK)

#define XRDC_B_CR_MRF_MASK                       (0x80U)
#define XRDC_B_CR_MRF_SHIFT                      (7U)
#define XRDC_B_CR_MRF_WIDTH                      (1U)
#define XRDC_B_CR_MRF(x)                         (((uint32_t)(((uint32_t)(x)) << XRDC_B_CR_MRF_SHIFT)) & XRDC_B_CR_MRF_MASK)

#define XRDC_B_CR_VAW_MASK                       (0x100U)
#define XRDC_B_CR_VAW_SHIFT                      (8U)
#define XRDC_B_CR_VAW_WIDTH                      (1U)
#define XRDC_B_CR_VAW(x)                         (((uint32_t)(((uint32_t)(x)) << XRDC_B_CR_VAW_SHIFT)) & XRDC_B_CR_VAW_MASK)

#define XRDC_B_CR_LK1_MASK                       (0x40000000U)
#define XRDC_B_CR_LK1_SHIFT                      (30U)
#define XRDC_B_CR_LK1_WIDTH                      (1U)
#define XRDC_B_CR_LK1(x)                         (((uint32_t)(((uint32_t)(x)) << XRDC_B_CR_LK1_SHIFT)) & XRDC_B_CR_LK1_MASK)
/*! @} */

/*! @name HWCFG0 - Hardware Configuration 0 */
/*! @{ */

#define XRDC_B_HWCFG0_NDID_MASK                  (0xFFU)
#define XRDC_B_HWCFG0_NDID_SHIFT                 (0U)
#define XRDC_B_HWCFG0_NDID_WIDTH                 (8U)
#define XRDC_B_HWCFG0_NDID(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG0_NDID_SHIFT)) & XRDC_B_HWCFG0_NDID_MASK)

#define XRDC_B_HWCFG0_NMSTR_MASK                 (0xFF00U)
#define XRDC_B_HWCFG0_NMSTR_SHIFT                (8U)
#define XRDC_B_HWCFG0_NMSTR_WIDTH                (8U)
#define XRDC_B_HWCFG0_NMSTR(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG0_NMSTR_SHIFT)) & XRDC_B_HWCFG0_NMSTR_MASK)

#define XRDC_B_HWCFG0_NMRC_MASK                  (0xFF0000U)
#define XRDC_B_HWCFG0_NMRC_SHIFT                 (16U)
#define XRDC_B_HWCFG0_NMRC_WIDTH                 (8U)
#define XRDC_B_HWCFG0_NMRC(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG0_NMRC_SHIFT)) & XRDC_B_HWCFG0_NMRC_MASK)

#define XRDC_B_HWCFG0_NPAC_MASK                  (0xF000000U)
#define XRDC_B_HWCFG0_NPAC_SHIFT                 (24U)
#define XRDC_B_HWCFG0_NPAC_WIDTH                 (4U)
#define XRDC_B_HWCFG0_NPAC(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG0_NPAC_SHIFT)) & XRDC_B_HWCFG0_NPAC_MASK)

#define XRDC_B_HWCFG0_MID_MASK                   (0xF0000000U)
#define XRDC_B_HWCFG0_MID_SHIFT                  (28U)
#define XRDC_B_HWCFG0_MID_WIDTH                  (4U)
#define XRDC_B_HWCFG0_MID(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG0_MID_SHIFT)) & XRDC_B_HWCFG0_MID_MASK)
/*! @} */

/*! @name HWCFG1 - Hardware Configuration 1 */
/*! @{ */

#define XRDC_B_HWCFG1_DID_MASK                   (0xFU)
#define XRDC_B_HWCFG1_DID_SHIFT                  (0U)
#define XRDC_B_HWCFG1_DID_WIDTH                  (4U)
#define XRDC_B_HWCFG1_DID(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG1_DID_SHIFT)) & XRDC_B_HWCFG1_DID_MASK)
/*! @} */

/*! @name HWCFG2 - Hardware Configuration 2 */
/*! @{ */

#define XRDC_B_HWCFG2_PIDP0_MASK                 (0x1U)
#define XRDC_B_HWCFG2_PIDP0_SHIFT                (0U)
#define XRDC_B_HWCFG2_PIDP0_WIDTH                (1U)
#define XRDC_B_HWCFG2_PIDP0(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG2_PIDP0_SHIFT)) & XRDC_B_HWCFG2_PIDP0_MASK)

#define XRDC_B_HWCFG2_PIDP1_MASK                 (0x2U)
#define XRDC_B_HWCFG2_PIDP1_SHIFT                (1U)
#define XRDC_B_HWCFG2_PIDP1_WIDTH                (1U)
#define XRDC_B_HWCFG2_PIDP1(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG2_PIDP1_SHIFT)) & XRDC_B_HWCFG2_PIDP1_MASK)

#define XRDC_B_HWCFG2_PIDP2_MASK                 (0x4U)
#define XRDC_B_HWCFG2_PIDP2_SHIFT                (2U)
#define XRDC_B_HWCFG2_PIDP2_WIDTH                (1U)
#define XRDC_B_HWCFG2_PIDP2(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG2_PIDP2_SHIFT)) & XRDC_B_HWCFG2_PIDP2_MASK)

#define XRDC_B_HWCFG2_PIDP3_MASK                 (0x8U)
#define XRDC_B_HWCFG2_PIDP3_SHIFT                (3U)
#define XRDC_B_HWCFG2_PIDP3_WIDTH                (1U)
#define XRDC_B_HWCFG2_PIDP3(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG2_PIDP3_SHIFT)) & XRDC_B_HWCFG2_PIDP3_MASK)

#define XRDC_B_HWCFG2_PIDP4_MASK                 (0x10U)
#define XRDC_B_HWCFG2_PIDP4_SHIFT                (4U)
#define XRDC_B_HWCFG2_PIDP4_WIDTH                (1U)
#define XRDC_B_HWCFG2_PIDP4(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG2_PIDP4_SHIFT)) & XRDC_B_HWCFG2_PIDP4_MASK)

#define XRDC_B_HWCFG2_PIDP5_MASK                 (0x20U)
#define XRDC_B_HWCFG2_PIDP5_SHIFT                (5U)
#define XRDC_B_HWCFG2_PIDP5_WIDTH                (1U)
#define XRDC_B_HWCFG2_PIDP5(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG2_PIDP5_SHIFT)) & XRDC_B_HWCFG2_PIDP5_MASK)

#define XRDC_B_HWCFG2_PIDP6_MASK                 (0x40U)
#define XRDC_B_HWCFG2_PIDP6_SHIFT                (6U)
#define XRDC_B_HWCFG2_PIDP6_WIDTH                (1U)
#define XRDC_B_HWCFG2_PIDP6(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG2_PIDP6_SHIFT)) & XRDC_B_HWCFG2_PIDP6_MASK)

#define XRDC_B_HWCFG2_PIDP7_MASK                 (0x80U)
#define XRDC_B_HWCFG2_PIDP7_SHIFT                (7U)
#define XRDC_B_HWCFG2_PIDP7_WIDTH                (1U)
#define XRDC_B_HWCFG2_PIDP7(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG2_PIDP7_SHIFT)) & XRDC_B_HWCFG2_PIDP7_MASK)

#define XRDC_B_HWCFG2_PIDP8_MASK                 (0x100U)
#define XRDC_B_HWCFG2_PIDP8_SHIFT                (8U)
#define XRDC_B_HWCFG2_PIDP8_WIDTH                (1U)
#define XRDC_B_HWCFG2_PIDP8(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG2_PIDP8_SHIFT)) & XRDC_B_HWCFG2_PIDP8_MASK)

#define XRDC_B_HWCFG2_PIDP9_MASK                 (0x200U)
#define XRDC_B_HWCFG2_PIDP9_SHIFT                (9U)
#define XRDC_B_HWCFG2_PIDP9_WIDTH                (1U)
#define XRDC_B_HWCFG2_PIDP9(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG2_PIDP9_SHIFT)) & XRDC_B_HWCFG2_PIDP9_MASK)

#define XRDC_B_HWCFG2_PIDP10_MASK                (0x400U)
#define XRDC_B_HWCFG2_PIDP10_SHIFT               (10U)
#define XRDC_B_HWCFG2_PIDP10_WIDTH               (1U)
#define XRDC_B_HWCFG2_PIDP10(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG2_PIDP10_SHIFT)) & XRDC_B_HWCFG2_PIDP10_MASK)

