zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XRDC_B.h
#define XRDC_B_HWCFG2_PIDP31_MASK                (0x80000000U)
#define XRDC_B_HWCFG2_PIDP31_SHIFT               (31U)
#define XRDC_B_HWCFG2_PIDP31_WIDTH               (1U)
#define XRDC_B_HWCFG2_PIDP31(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_HWCFG2_PIDP31_SHIFT)) & XRDC_B_HWCFG2_PIDP31_MASK)
/*! @} */

/*! @name MDACFG - Master Domain Assignment Configuration */
/*! @{ */

#define XRDC_B_MDACFG_NMDAR_MASK                 (0xFU)
#define XRDC_B_MDACFG_NMDAR_SHIFT                (0U)
#define XRDC_B_MDACFG_NMDAR_WIDTH                (4U)
#define XRDC_B_MDACFG_NMDAR(x)                   (((uint8_t)(((uint8_t)(x)) << XRDC_B_MDACFG_NMDAR_SHIFT)) & XRDC_B_MDACFG_NMDAR_MASK)

#define XRDC_B_MDACFG_NCM_MASK                   (0x80U)
#define XRDC_B_MDACFG_NCM_SHIFT                  (7U)
#define XRDC_B_MDACFG_NCM_WIDTH                  (1U)
#define XRDC_B_MDACFG_NCM(x)                     (((uint8_t)(((uint8_t)(x)) << XRDC_B_MDACFG_NCM_SHIFT)) & XRDC_B_MDACFG_NCM_MASK)
/*! @} */

/*! @name MRCFG - Memory Region Configuration */
/*! @{ */

#define XRDC_B_MRCFG_NMRGD_MASK                  (0x1FU)
#define XRDC_B_MRCFG_NMRGD_SHIFT                 (0U)
#define XRDC_B_MRCFG_NMRGD_WIDTH                 (5U)
#define XRDC_B_MRCFG_NMRGD(x)                    (((uint8_t)(((uint8_t)(x)) << XRDC_B_MRCFG_NMRGD_SHIFT)) & XRDC_B_MRCFG_NMRGD_MASK)
/*! @} */

/*! @name DERRLOC - Domain Error Location */
/*! @{ */

#define XRDC_B_DERRLOC_MRCINST_MASK              (0xFFFFU)
#define XRDC_B_DERRLOC_MRCINST_SHIFT             (0U)
#define XRDC_B_DERRLOC_MRCINST_WIDTH             (16U)
#define XRDC_B_DERRLOC_MRCINST(x)                (((uint32_t)(((uint32_t)(x)) << XRDC_B_DERRLOC_MRCINST_SHIFT)) & XRDC_B_DERRLOC_MRCINST_MASK)

#define XRDC_B_DERRLOC_PACINST_MASK              (0xFF0000U)
#define XRDC_B_DERRLOC_PACINST_SHIFT             (16U)
#define XRDC_B_DERRLOC_PACINST_WIDTH             (8U)
#define XRDC_B_DERRLOC_PACINST(x)                (((uint32_t)(((uint32_t)(x)) << XRDC_B_DERRLOC_PACINST_SHIFT)) & XRDC_B_DERRLOC_PACINST_MASK)
/*! @} */

/*! @name DERR_W0 - Domain Error Word 0 */
/*! @{ */

#define XRDC_B_DERR_W0_EADDR_MASK                (0xFFFFFFFFU)
#define XRDC_B_DERR_W0_EADDR_SHIFT               (0U)
#define XRDC_B_DERR_W0_EADDR_WIDTH               (32U)
#define XRDC_B_DERR_W0_EADDR(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_DERR_W0_EADDR_SHIFT)) & XRDC_B_DERR_W0_EADDR_MASK)
/*! @} */

/*! @name DERR_W1 - Domain Error Word 1 */
/*! @{ */

#define XRDC_B_DERR_W1_EDID_MASK                 (0xFU)
#define XRDC_B_DERR_W1_EDID_SHIFT                (0U)
#define XRDC_B_DERR_W1_EDID_WIDTH                (4U)
#define XRDC_B_DERR_W1_EDID(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_DERR_W1_EDID_SHIFT)) & XRDC_B_DERR_W1_EDID_MASK)

#define XRDC_B_DERR_W1_EATR_MASK                 (0x700U)
#define XRDC_B_DERR_W1_EATR_SHIFT                (8U)
#define XRDC_B_DERR_W1_EATR_WIDTH                (3U)
#define XRDC_B_DERR_W1_EATR(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_DERR_W1_EATR_SHIFT)) & XRDC_B_DERR_W1_EATR_MASK)

#define XRDC_B_DERR_W1_ERW_MASK                  (0x800U)
#define XRDC_B_DERR_W1_ERW_SHIFT                 (11U)
#define XRDC_B_DERR_W1_ERW_WIDTH                 (1U)
#define XRDC_B_DERR_W1_ERW(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_B_DERR_W1_ERW_SHIFT)) & XRDC_B_DERR_W1_ERW_MASK)

#define XRDC_B_DERR_W1_EPORT_MASK                (0x7000000U)
#define XRDC_B_DERR_W1_EPORT_SHIFT               (24U)
#define XRDC_B_DERR_W1_EPORT_WIDTH               (3U)
#define XRDC_B_DERR_W1_EPORT(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_DERR_W1_EPORT_SHIFT)) & XRDC_B_DERR_W1_EPORT_MASK)

#define XRDC_B_DERR_W1_EST_MASK                  (0xC0000000U)
#define XRDC_B_DERR_W1_EST_SHIFT                 (30U)
#define XRDC_B_DERR_W1_EST_WIDTH                 (2U)
#define XRDC_B_DERR_W1_EST(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_B_DERR_W1_EST_SHIFT)) & XRDC_B_DERR_W1_EST_MASK)
/*! @} */

/*! @name DERR_W3 - Domain Error Word 3 */
/*! @{ */

#define XRDC_B_DERR_W3_RECR_MASK                 (0xC0000000U)
#define XRDC_B_DERR_W3_RECR_SHIFT                (30U)
#define XRDC_B_DERR_W3_RECR_WIDTH                (2U)
#define XRDC_B_DERR_W3_RECR(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_DERR_W3_RECR_SHIFT)) & XRDC_B_DERR_W3_RECR_MASK)
/*! @} */

/*! @name PID - Process Identifier */
/*! @{ */

#define XRDC_B_PID_PID_MASK                      (0x3FU)
#define XRDC_B_PID_PID_SHIFT                     (0U)
#define XRDC_B_PID_PID_WIDTH                     (6U)
#define XRDC_B_PID_PID(x)                        (((uint32_t)(((uint32_t)(x)) << XRDC_B_PID_PID_SHIFT)) & XRDC_B_PID_PID_MASK)

#define XRDC_B_PID_TSM_MASK                      (0x10000000U)
#define XRDC_B_PID_TSM_SHIFT                     (28U)
#define XRDC_B_PID_TSM_WIDTH                     (1U)
#define XRDC_B_PID_TSM(x)                        (((uint32_t)(((uint32_t)(x)) << XRDC_B_PID_TSM_SHIFT)) & XRDC_B_PID_TSM_MASK)

#define XRDC_B_PID_LK2_MASK                      (0x60000000U)
#define XRDC_B_PID_LK2_SHIFT                     (29U)
#define XRDC_B_PID_LK2_WIDTH                     (2U)
#define XRDC_B_PID_LK2(x)                        (((uint32_t)(((uint32_t)(x)) << XRDC_B_PID_LK2_SHIFT)) & XRDC_B_PID_LK2_MASK)
/*! @} */

/*! @name MDA_W0_0_DFMT0 - Master Domain Assignment */
/*! @{ */

#define XRDC_B_MDA_W0_0_DFMT0_DID_MASK           (0xFU)
#define XRDC_B_MDA_W0_0_DFMT0_DID_SHIFT          (0U)
#define XRDC_B_MDA_W0_0_DFMT0_DID_WIDTH          (4U)
#define XRDC_B_MDA_W0_0_DFMT0_DID(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W0_0_DFMT0_DID_SHIFT)) & XRDC_B_MDA_W0_0_DFMT0_DID_MASK)

#define XRDC_B_MDA_W0_0_DFMT0_DIDS_MASK          (0x30U)
#define XRDC_B_MDA_W0_0_DFMT0_DIDS_SHIFT         (4U)
#define XRDC_B_MDA_W0_0_DFMT0_DIDS_WIDTH         (2U)
#define XRDC_B_MDA_W0_0_DFMT0_DIDS(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W0_0_DFMT0_DIDS_SHIFT)) & XRDC_B_MDA_W0_0_DFMT0_DIDS_MASK)

#define XRDC_B_MDA_W0_0_DFMT0_PE_MASK            (0xC0U)
#define XRDC_B_MDA_W0_0_DFMT0_PE_SHIFT           (6U)
#define XRDC_B_MDA_W0_0_DFMT0_PE_WIDTH           (2U)
#define XRDC_B_MDA_W0_0_DFMT0_PE(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W0_0_DFMT0_PE_SHIFT)) & XRDC_B_MDA_W0_0_DFMT0_PE_MASK)

#define XRDC_B_MDA_W0_0_DFMT0_PIDM_MASK          (0x3F00U)
#define XRDC_B_MDA_W0_0_DFMT0_PIDM_SHIFT         (8U)
#define XRDC_B_MDA_W0_0_DFMT0_PIDM_WIDTH         (6U)
#define XRDC_B_MDA_W0_0_DFMT0_PIDM(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W0_0_DFMT0_PIDM_SHIFT)) & XRDC_B_MDA_W0_0_DFMT0_PIDM_MASK)

#define XRDC_B_MDA_W0_0_DFMT0_PID_MASK           (0x3F0000U)
#define XRDC_B_MDA_W0_0_DFMT0_PID_SHIFT          (16U)
#define XRDC_B_MDA_W0_0_DFMT0_PID_WIDTH          (6U)
#define XRDC_B_MDA_W0_0_DFMT0_PID(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W0_0_DFMT0_PID_SHIFT)) & XRDC_B_MDA_W0_0_DFMT0_PID_MASK)

#define XRDC_B_MDA_W0_0_DFMT0_DFMT_MASK          (0x20000000U)
#define XRDC_B_MDA_W0_0_DFMT0_DFMT_SHIFT         (29U)
#define XRDC_B_MDA_W0_0_DFMT0_DFMT_WIDTH         (1U)
#define XRDC_B_MDA_W0_0_DFMT0_DFMT(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W0_0_DFMT0_DFMT_SHIFT)) & XRDC_B_MDA_W0_0_DFMT0_DFMT_MASK)

#define XRDC_B_MDA_W0_0_DFMT0_LK1_MASK           (0x40000000U)
#define XRDC_B_MDA_W0_0_DFMT0_LK1_SHIFT          (30U)
#define XRDC_B_MDA_W0_0_DFMT0_LK1_WIDTH          (1U)
#define XRDC_B_MDA_W0_0_DFMT0_LK1(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W0_0_DFMT0_LK1_SHIFT)) & XRDC_B_MDA_W0_0_DFMT0_LK1_MASK)

#define XRDC_B_MDA_W0_0_DFMT0_VLD_MASK           (0x80000000U)
#define XRDC_B_MDA_W0_0_DFMT0_VLD_SHIFT          (31U)
#define XRDC_B_MDA_W0_0_DFMT0_VLD_WIDTH          (1U)
#define XRDC_B_MDA_W0_0_DFMT0_VLD(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W0_0_DFMT0_VLD_SHIFT)) & XRDC_B_MDA_W0_0_DFMT0_VLD_MASK)
/*! @} */

/*! @name MDA_W1_0_DFMT0 - Master Domain Assignment */
/*! @{ */

