zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XRDC_B.h
#define XRDC_B_MDA_W0_2_DFMT0_PID_MASK           (0x3F0000U)
#define XRDC_B_MDA_W0_2_DFMT0_PID_SHIFT          (16U)
#define XRDC_B_MDA_W0_2_DFMT0_PID_WIDTH          (6U)
#define XRDC_B_MDA_W0_2_DFMT0_PID(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W0_2_DFMT0_PID_SHIFT)) & XRDC_B_MDA_W0_2_DFMT0_PID_MASK)

#define XRDC_B_MDA_W0_2_DFMT0_DFMT_MASK          (0x20000000U)
#define XRDC_B_MDA_W0_2_DFMT0_DFMT_SHIFT         (29U)
#define XRDC_B_MDA_W0_2_DFMT0_DFMT_WIDTH         (1U)
#define XRDC_B_MDA_W0_2_DFMT0_DFMT(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W0_2_DFMT0_DFMT_SHIFT)) & XRDC_B_MDA_W0_2_DFMT0_DFMT_MASK)

#define XRDC_B_MDA_W0_2_DFMT0_LK1_MASK           (0x40000000U)
#define XRDC_B_MDA_W0_2_DFMT0_LK1_SHIFT          (30U)
#define XRDC_B_MDA_W0_2_DFMT0_LK1_WIDTH          (1U)
#define XRDC_B_MDA_W0_2_DFMT0_LK1(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W0_2_DFMT0_LK1_SHIFT)) & XRDC_B_MDA_W0_2_DFMT0_LK1_MASK)

#define XRDC_B_MDA_W0_2_DFMT0_VLD_MASK           (0x80000000U)
#define XRDC_B_MDA_W0_2_DFMT0_VLD_SHIFT          (31U)
#define XRDC_B_MDA_W0_2_DFMT0_VLD_WIDTH          (1U)
#define XRDC_B_MDA_W0_2_DFMT0_VLD(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W0_2_DFMT0_VLD_SHIFT)) & XRDC_B_MDA_W0_2_DFMT0_VLD_MASK)
/*! @} */

/*! @name MDA_W1_2_DFMT0 - Master Domain Assignment */
/*! @{ */

#define XRDC_B_MDA_W1_2_DFMT0_DID_MASK           (0xFU)
#define XRDC_B_MDA_W1_2_DFMT0_DID_SHIFT          (0U)
#define XRDC_B_MDA_W1_2_DFMT0_DID_WIDTH          (4U)
#define XRDC_B_MDA_W1_2_DFMT0_DID(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W1_2_DFMT0_DID_SHIFT)) & XRDC_B_MDA_W1_2_DFMT0_DID_MASK)

#define XRDC_B_MDA_W1_2_DFMT0_DIDS_MASK          (0x30U)
#define XRDC_B_MDA_W1_2_DFMT0_DIDS_SHIFT         (4U)
#define XRDC_B_MDA_W1_2_DFMT0_DIDS_WIDTH         (2U)
#define XRDC_B_MDA_W1_2_DFMT0_DIDS(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W1_2_DFMT0_DIDS_SHIFT)) & XRDC_B_MDA_W1_2_DFMT0_DIDS_MASK)

#define XRDC_B_MDA_W1_2_DFMT0_PE_MASK            (0xC0U)
#define XRDC_B_MDA_W1_2_DFMT0_PE_SHIFT           (6U)
#define XRDC_B_MDA_W1_2_DFMT0_PE_WIDTH           (2U)
#define XRDC_B_MDA_W1_2_DFMT0_PE(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W1_2_DFMT0_PE_SHIFT)) & XRDC_B_MDA_W1_2_DFMT0_PE_MASK)

#define XRDC_B_MDA_W1_2_DFMT0_PIDM_MASK          (0x3F00U)
#define XRDC_B_MDA_W1_2_DFMT0_PIDM_SHIFT         (8U)
#define XRDC_B_MDA_W1_2_DFMT0_PIDM_WIDTH         (6U)
#define XRDC_B_MDA_W1_2_DFMT0_PIDM(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W1_2_DFMT0_PIDM_SHIFT)) & XRDC_B_MDA_W1_2_DFMT0_PIDM_MASK)

#define XRDC_B_MDA_W1_2_DFMT0_PID_MASK           (0x3F0000U)
#define XRDC_B_MDA_W1_2_DFMT0_PID_SHIFT          (16U)
#define XRDC_B_MDA_W1_2_DFMT0_PID_WIDTH          (6U)
#define XRDC_B_MDA_W1_2_DFMT0_PID(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W1_2_DFMT0_PID_SHIFT)) & XRDC_B_MDA_W1_2_DFMT0_PID_MASK)

#define XRDC_B_MDA_W1_2_DFMT0_DFMT_MASK          (0x20000000U)
#define XRDC_B_MDA_W1_2_DFMT0_DFMT_SHIFT         (29U)
#define XRDC_B_MDA_W1_2_DFMT0_DFMT_WIDTH         (1U)
#define XRDC_B_MDA_W1_2_DFMT0_DFMT(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W1_2_DFMT0_DFMT_SHIFT)) & XRDC_B_MDA_W1_2_DFMT0_DFMT_MASK)

#define XRDC_B_MDA_W1_2_DFMT0_LK1_MASK           (0x40000000U)
#define XRDC_B_MDA_W1_2_DFMT0_LK1_SHIFT          (30U)
#define XRDC_B_MDA_W1_2_DFMT0_LK1_WIDTH          (1U)
#define XRDC_B_MDA_W1_2_DFMT0_LK1(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W1_2_DFMT0_LK1_SHIFT)) & XRDC_B_MDA_W1_2_DFMT0_LK1_MASK)

#define XRDC_B_MDA_W1_2_DFMT0_VLD_MASK           (0x80000000U)
#define XRDC_B_MDA_W1_2_DFMT0_VLD_SHIFT          (31U)
#define XRDC_B_MDA_W1_2_DFMT0_VLD_WIDTH          (1U)
#define XRDC_B_MDA_W1_2_DFMT0_VLD(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W1_2_DFMT0_VLD_SHIFT)) & XRDC_B_MDA_W1_2_DFMT0_VLD_MASK)
/*! @} */

/*! @name MDA_W2_2_DFMT0 - Master Domain Assignment */
/*! @{ */

#define XRDC_B_MDA_W2_2_DFMT0_DID_MASK           (0xFU)
#define XRDC_B_MDA_W2_2_DFMT0_DID_SHIFT          (0U)
#define XRDC_B_MDA_W2_2_DFMT0_DID_WIDTH          (4U)
#define XRDC_B_MDA_W2_2_DFMT0_DID(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_2_DFMT0_DID_SHIFT)) & XRDC_B_MDA_W2_2_DFMT0_DID_MASK)

#define XRDC_B_MDA_W2_2_DFMT0_DIDS_MASK          (0x30U)
#define XRDC_B_MDA_W2_2_DFMT0_DIDS_SHIFT         (4U)
#define XRDC_B_MDA_W2_2_DFMT0_DIDS_WIDTH         (2U)
#define XRDC_B_MDA_W2_2_DFMT0_DIDS(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_2_DFMT0_DIDS_SHIFT)) & XRDC_B_MDA_W2_2_DFMT0_DIDS_MASK)

#define XRDC_B_MDA_W2_2_DFMT0_PE_MASK            (0xC0U)
#define XRDC_B_MDA_W2_2_DFMT0_PE_SHIFT           (6U)
#define XRDC_B_MDA_W2_2_DFMT0_PE_WIDTH           (2U)
#define XRDC_B_MDA_W2_2_DFMT0_PE(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_2_DFMT0_PE_SHIFT)) & XRDC_B_MDA_W2_2_DFMT0_PE_MASK)

#define XRDC_B_MDA_W2_2_DFMT0_PIDM_MASK          (0x3F00U)
#define XRDC_B_MDA_W2_2_DFMT0_PIDM_SHIFT         (8U)
#define XRDC_B_MDA_W2_2_DFMT0_PIDM_WIDTH         (6U)
#define XRDC_B_MDA_W2_2_DFMT0_PIDM(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_2_DFMT0_PIDM_SHIFT)) & XRDC_B_MDA_W2_2_DFMT0_PIDM_MASK)

#define XRDC_B_MDA_W2_2_DFMT0_PID_MASK           (0x3F0000U)
#define XRDC_B_MDA_W2_2_DFMT0_PID_SHIFT          (16U)
#define XRDC_B_MDA_W2_2_DFMT0_PID_WIDTH          (6U)
#define XRDC_B_MDA_W2_2_DFMT0_PID(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_2_DFMT0_PID_SHIFT)) & XRDC_B_MDA_W2_2_DFMT0_PID_MASK)

#define XRDC_B_MDA_W2_2_DFMT0_DFMT_MASK          (0x20000000U)
#define XRDC_B_MDA_W2_2_DFMT0_DFMT_SHIFT         (29U)
#define XRDC_B_MDA_W2_2_DFMT0_DFMT_WIDTH         (1U)
#define XRDC_B_MDA_W2_2_DFMT0_DFMT(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_2_DFMT0_DFMT_SHIFT)) & XRDC_B_MDA_W2_2_DFMT0_DFMT_MASK)

#define XRDC_B_MDA_W2_2_DFMT0_LK1_MASK           (0x40000000U)
#define XRDC_B_MDA_W2_2_DFMT0_LK1_SHIFT          (30U)
#define XRDC_B_MDA_W2_2_DFMT0_LK1_WIDTH          (1U)
#define XRDC_B_MDA_W2_2_DFMT0_LK1(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_2_DFMT0_LK1_SHIFT)) & XRDC_B_MDA_W2_2_DFMT0_LK1_MASK)

#define XRDC_B_MDA_W2_2_DFMT0_VLD_MASK           (0x80000000U)
#define XRDC_B_MDA_W2_2_DFMT0_VLD_SHIFT          (31U)
#define XRDC_B_MDA_W2_2_DFMT0_VLD_WIDTH          (1U)
#define XRDC_B_MDA_W2_2_DFMT0_VLD(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_2_DFMT0_VLD_SHIFT)) & XRDC_B_MDA_W2_2_DFMT0_VLD_MASK)
/*! @} */

/*! @name MDA_W3_2_DFMT0 - Master Domain Assignment */
/*! @{ */

#define XRDC_B_MDA_W3_2_DFMT0_DID_MASK           (0xFU)
#define XRDC_B_MDA_W3_2_DFMT0_DID_SHIFT          (0U)
#define XRDC_B_MDA_W3_2_DFMT0_DID_WIDTH          (4U)
#define XRDC_B_MDA_W3_2_DFMT0_DID(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W3_2_DFMT0_DID_SHIFT)) & XRDC_B_MDA_W3_2_DFMT0_DID_MASK)

#define XRDC_B_MDA_W3_2_DFMT0_DIDS_MASK          (0x30U)
#define XRDC_B_MDA_W3_2_DFMT0_DIDS_SHIFT         (4U)
#define XRDC_B_MDA_W3_2_DFMT0_DIDS_WIDTH         (2U)
#define XRDC_B_MDA_W3_2_DFMT0_DIDS(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W3_2_DFMT0_DIDS_SHIFT)) & XRDC_B_MDA_W3_2_DFMT0_DIDS_MASK)

