zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XRDC_B.h
#define XRDC_B_MDA_W2_13_DFMT0_DIDS_MASK         (0x30U)
#define XRDC_B_MDA_W2_13_DFMT0_DIDS_SHIFT        (4U)
#define XRDC_B_MDA_W2_13_DFMT0_DIDS_WIDTH        (2U)
#define XRDC_B_MDA_W2_13_DFMT0_DIDS(x)           (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_13_DFMT0_DIDS_SHIFT)) & XRDC_B_MDA_W2_13_DFMT0_DIDS_MASK)

#define XRDC_B_MDA_W2_13_DFMT0_PE_MASK           (0xC0U)
#define XRDC_B_MDA_W2_13_DFMT0_PE_SHIFT          (6U)
#define XRDC_B_MDA_W2_13_DFMT0_PE_WIDTH          (2U)
#define XRDC_B_MDA_W2_13_DFMT0_PE(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_13_DFMT0_PE_SHIFT)) & XRDC_B_MDA_W2_13_DFMT0_PE_MASK)

#define XRDC_B_MDA_W2_13_DFMT0_PIDM_MASK         (0x3F00U)
#define XRDC_B_MDA_W2_13_DFMT0_PIDM_SHIFT        (8U)
#define XRDC_B_MDA_W2_13_DFMT0_PIDM_WIDTH        (6U)
#define XRDC_B_MDA_W2_13_DFMT0_PIDM(x)           (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_13_DFMT0_PIDM_SHIFT)) & XRDC_B_MDA_W2_13_DFMT0_PIDM_MASK)

#define XRDC_B_MDA_W2_13_DFMT0_PID_MASK          (0x3F0000U)
#define XRDC_B_MDA_W2_13_DFMT0_PID_SHIFT         (16U)
#define XRDC_B_MDA_W2_13_DFMT0_PID_WIDTH         (6U)
#define XRDC_B_MDA_W2_13_DFMT0_PID(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_13_DFMT0_PID_SHIFT)) & XRDC_B_MDA_W2_13_DFMT0_PID_MASK)

#define XRDC_B_MDA_W2_13_DFMT0_DFMT_MASK         (0x20000000U)
#define XRDC_B_MDA_W2_13_DFMT0_DFMT_SHIFT        (29U)
#define XRDC_B_MDA_W2_13_DFMT0_DFMT_WIDTH        (1U)
#define XRDC_B_MDA_W2_13_DFMT0_DFMT(x)           (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_13_DFMT0_DFMT_SHIFT)) & XRDC_B_MDA_W2_13_DFMT0_DFMT_MASK)

#define XRDC_B_MDA_W2_13_DFMT0_LK1_MASK          (0x40000000U)
#define XRDC_B_MDA_W2_13_DFMT0_LK1_SHIFT         (30U)
#define XRDC_B_MDA_W2_13_DFMT0_LK1_WIDTH         (1U)
#define XRDC_B_MDA_W2_13_DFMT0_LK1(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_13_DFMT0_LK1_SHIFT)) & XRDC_B_MDA_W2_13_DFMT0_LK1_MASK)

#define XRDC_B_MDA_W2_13_DFMT0_VLD_MASK          (0x80000000U)
#define XRDC_B_MDA_W2_13_DFMT0_VLD_SHIFT         (31U)
#define XRDC_B_MDA_W2_13_DFMT0_VLD_WIDTH         (1U)
#define XRDC_B_MDA_W2_13_DFMT0_VLD(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W2_13_DFMT0_VLD_SHIFT)) & XRDC_B_MDA_W2_13_DFMT0_VLD_MASK)
/*! @} */

/*! @name MDA_W3_13_DFMT0 - Master Domain Assignment */
/*! @{ */

#define XRDC_B_MDA_W3_13_DFMT0_DID_MASK          (0xFU)
#define XRDC_B_MDA_W3_13_DFMT0_DID_SHIFT         (0U)
#define XRDC_B_MDA_W3_13_DFMT0_DID_WIDTH         (4U)
#define XRDC_B_MDA_W3_13_DFMT0_DID(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W3_13_DFMT0_DID_SHIFT)) & XRDC_B_MDA_W3_13_DFMT0_DID_MASK)

#define XRDC_B_MDA_W3_13_DFMT0_DIDS_MASK         (0x30U)
#define XRDC_B_MDA_W3_13_DFMT0_DIDS_SHIFT        (4U)
#define XRDC_B_MDA_W3_13_DFMT0_DIDS_WIDTH        (2U)
#define XRDC_B_MDA_W3_13_DFMT0_DIDS(x)           (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W3_13_DFMT0_DIDS_SHIFT)) & XRDC_B_MDA_W3_13_DFMT0_DIDS_MASK)

#define XRDC_B_MDA_W3_13_DFMT0_PE_MASK           (0xC0U)
#define XRDC_B_MDA_W3_13_DFMT0_PE_SHIFT          (6U)
#define XRDC_B_MDA_W3_13_DFMT0_PE_WIDTH          (2U)
#define XRDC_B_MDA_W3_13_DFMT0_PE(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W3_13_DFMT0_PE_SHIFT)) & XRDC_B_MDA_W3_13_DFMT0_PE_MASK)

#define XRDC_B_MDA_W3_13_DFMT0_PIDM_MASK         (0x3F00U)
#define XRDC_B_MDA_W3_13_DFMT0_PIDM_SHIFT        (8U)
#define XRDC_B_MDA_W3_13_DFMT0_PIDM_WIDTH        (6U)
#define XRDC_B_MDA_W3_13_DFMT0_PIDM(x)           (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W3_13_DFMT0_PIDM_SHIFT)) & XRDC_B_MDA_W3_13_DFMT0_PIDM_MASK)

#define XRDC_B_MDA_W3_13_DFMT0_PID_MASK          (0x3F0000U)
#define XRDC_B_MDA_W3_13_DFMT0_PID_SHIFT         (16U)
#define XRDC_B_MDA_W3_13_DFMT0_PID_WIDTH         (6U)
#define XRDC_B_MDA_W3_13_DFMT0_PID(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W3_13_DFMT0_PID_SHIFT)) & XRDC_B_MDA_W3_13_DFMT0_PID_MASK)

#define XRDC_B_MDA_W3_13_DFMT0_DFMT_MASK         (0x20000000U)
#define XRDC_B_MDA_W3_13_DFMT0_DFMT_SHIFT        (29U)
#define XRDC_B_MDA_W3_13_DFMT0_DFMT_WIDTH        (1U)
#define XRDC_B_MDA_W3_13_DFMT0_DFMT(x)           (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W3_13_DFMT0_DFMT_SHIFT)) & XRDC_B_MDA_W3_13_DFMT0_DFMT_MASK)

#define XRDC_B_MDA_W3_13_DFMT0_LK1_MASK          (0x40000000U)
#define XRDC_B_MDA_W3_13_DFMT0_LK1_SHIFT         (30U)
#define XRDC_B_MDA_W3_13_DFMT0_LK1_WIDTH         (1U)
#define XRDC_B_MDA_W3_13_DFMT0_LK1(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W3_13_DFMT0_LK1_SHIFT)) & XRDC_B_MDA_W3_13_DFMT0_LK1_MASK)

#define XRDC_B_MDA_W3_13_DFMT0_VLD_MASK          (0x80000000U)
#define XRDC_B_MDA_W3_13_DFMT0_VLD_SHIFT         (31U)
#define XRDC_B_MDA_W3_13_DFMT0_VLD_WIDTH         (1U)
#define XRDC_B_MDA_W3_13_DFMT0_VLD(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_B_MDA_W3_13_DFMT0_VLD_SHIFT)) & XRDC_B_MDA_W3_13_DFMT0_VLD_MASK)
/*! @} */

/*! @name PDAC_W0 - Peripheral Domain Access Control Word 0 */
/*! @{ */

#define XRDC_B_PDAC_W0_D0ACP_MASK                (0x7U)
#define XRDC_B_PDAC_W0_D0ACP_SHIFT               (0U)
#define XRDC_B_PDAC_W0_D0ACP_WIDTH               (3U)
#define XRDC_B_PDAC_W0_D0ACP(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W0_D0ACP_SHIFT)) & XRDC_B_PDAC_W0_D0ACP_MASK)

#define XRDC_B_PDAC_W0_D1ACP_MASK                (0x38U)
#define XRDC_B_PDAC_W0_D1ACP_SHIFT               (3U)
#define XRDC_B_PDAC_W0_D1ACP_WIDTH               (3U)
#define XRDC_B_PDAC_W0_D1ACP(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W0_D1ACP_SHIFT)) & XRDC_B_PDAC_W0_D1ACP_MASK)

#define XRDC_B_PDAC_W0_D2ACP_MASK                (0x1C0U)
#define XRDC_B_PDAC_W0_D2ACP_SHIFT               (6U)
#define XRDC_B_PDAC_W0_D2ACP_WIDTH               (3U)
#define XRDC_B_PDAC_W0_D2ACP(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W0_D2ACP_SHIFT)) & XRDC_B_PDAC_W0_D2ACP_MASK)

#define XRDC_B_PDAC_W0_D3ACP_MASK                (0xE00U)
#define XRDC_B_PDAC_W0_D3ACP_SHIFT               (9U)
#define XRDC_B_PDAC_W0_D3ACP_WIDTH               (3U)
#define XRDC_B_PDAC_W0_D3ACP(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W0_D3ACP_SHIFT)) & XRDC_B_PDAC_W0_D3ACP_MASK)

#define XRDC_B_PDAC_W0_D4ACP_MASK                (0x7000U)
#define XRDC_B_PDAC_W0_D4ACP_SHIFT               (12U)
#define XRDC_B_PDAC_W0_D4ACP_WIDTH               (3U)
#define XRDC_B_PDAC_W0_D4ACP(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W0_D4ACP_SHIFT)) & XRDC_B_PDAC_W0_D4ACP_MASK)

#define XRDC_B_PDAC_W0_D5ACP_MASK                (0x38000U)
#define XRDC_B_PDAC_W0_D5ACP_SHIFT               (15U)
#define XRDC_B_PDAC_W0_D5ACP_WIDTH               (3U)
#define XRDC_B_PDAC_W0_D5ACP(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W0_D5ACP_SHIFT)) & XRDC_B_PDAC_W0_D5ACP_MASK)

#define XRDC_B_PDAC_W0_D6ACP_MASK                (0x1C0000U)
#define XRDC_B_PDAC_W0_D6ACP_SHIFT               (18U)
#define XRDC_B_PDAC_W0_D6ACP_WIDTH               (3U)
#define XRDC_B_PDAC_W0_D6ACP(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W0_D6ACP_SHIFT)) & XRDC_B_PDAC_W0_D6ACP_MASK)

