zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XRDC_B.h
#define XRDC_B_PDAC_W0_D7ACP_MASK                (0xE00000U)
#define XRDC_B_PDAC_W0_D7ACP_SHIFT               (21U)
#define XRDC_B_PDAC_W0_D7ACP_WIDTH               (3U)
#define XRDC_B_PDAC_W0_D7ACP(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W0_D7ACP_SHIFT)) & XRDC_B_PDAC_W0_D7ACP_MASK)

#define XRDC_B_PDAC_W0_SNUM_MASK                 (0xF000000U)
#define XRDC_B_PDAC_W0_SNUM_SHIFT                (24U)
#define XRDC_B_PDAC_W0_SNUM_WIDTH                (4U)
#define XRDC_B_PDAC_W0_SNUM(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W0_SNUM_SHIFT)) & XRDC_B_PDAC_W0_SNUM_MASK)

#define XRDC_B_PDAC_W0_SE_MASK                   (0x40000000U)
#define XRDC_B_PDAC_W0_SE_SHIFT                  (30U)
#define XRDC_B_PDAC_W0_SE_WIDTH                  (1U)
#define XRDC_B_PDAC_W0_SE(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W0_SE_SHIFT)) & XRDC_B_PDAC_W0_SE_MASK)
/*! @} */

/*! @name PDAC_W1 - Peripheral Domain Access Control Word 1 */
/*! @{ */

#define XRDC_B_PDAC_W1_D8ACP_MASK                (0x7U)
#define XRDC_B_PDAC_W1_D8ACP_SHIFT               (0U)
#define XRDC_B_PDAC_W1_D8ACP_WIDTH               (3U)
#define XRDC_B_PDAC_W1_D8ACP(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W1_D8ACP_SHIFT)) & XRDC_B_PDAC_W1_D8ACP_MASK)

#define XRDC_B_PDAC_W1_D9ACP_MASK                (0x38U)
#define XRDC_B_PDAC_W1_D9ACP_SHIFT               (3U)
#define XRDC_B_PDAC_W1_D9ACP_WIDTH               (3U)
#define XRDC_B_PDAC_W1_D9ACP(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W1_D9ACP_SHIFT)) & XRDC_B_PDAC_W1_D9ACP_MASK)

#define XRDC_B_PDAC_W1_D10ACP_MASK               (0x1C0U)
#define XRDC_B_PDAC_W1_D10ACP_SHIFT              (6U)
#define XRDC_B_PDAC_W1_D10ACP_WIDTH              (3U)
#define XRDC_B_PDAC_W1_D10ACP(x)                 (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W1_D10ACP_SHIFT)) & XRDC_B_PDAC_W1_D10ACP_MASK)

#define XRDC_B_PDAC_W1_D11ACP_MASK               (0xE00U)
#define XRDC_B_PDAC_W1_D11ACP_SHIFT              (9U)
#define XRDC_B_PDAC_W1_D11ACP_WIDTH              (3U)
#define XRDC_B_PDAC_W1_D11ACP(x)                 (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W1_D11ACP_SHIFT)) & XRDC_B_PDAC_W1_D11ACP_MASK)

#define XRDC_B_PDAC_W1_D12ACP_MASK               (0x7000U)
#define XRDC_B_PDAC_W1_D12ACP_SHIFT              (12U)
#define XRDC_B_PDAC_W1_D12ACP_WIDTH              (3U)
#define XRDC_B_PDAC_W1_D12ACP(x)                 (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W1_D12ACP_SHIFT)) & XRDC_B_PDAC_W1_D12ACP_MASK)

#define XRDC_B_PDAC_W1_D13ACP_MASK               (0x38000U)
#define XRDC_B_PDAC_W1_D13ACP_SHIFT              (15U)
#define XRDC_B_PDAC_W1_D13ACP_WIDTH              (3U)
#define XRDC_B_PDAC_W1_D13ACP(x)                 (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W1_D13ACP_SHIFT)) & XRDC_B_PDAC_W1_D13ACP_MASK)

#define XRDC_B_PDAC_W1_D14ACP_MASK               (0x1C0000U)
#define XRDC_B_PDAC_W1_D14ACP_SHIFT              (18U)
#define XRDC_B_PDAC_W1_D14ACP_WIDTH              (3U)
#define XRDC_B_PDAC_W1_D14ACP(x)                 (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W1_D14ACP_SHIFT)) & XRDC_B_PDAC_W1_D14ACP_MASK)

#define XRDC_B_PDAC_W1_D15ACP_MASK               (0xE00000U)
#define XRDC_B_PDAC_W1_D15ACP_SHIFT              (21U)
#define XRDC_B_PDAC_W1_D15ACP_WIDTH              (3U)
#define XRDC_B_PDAC_W1_D15ACP(x)                 (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W1_D15ACP_SHIFT)) & XRDC_B_PDAC_W1_D15ACP_MASK)

#define XRDC_B_PDAC_W1_LK2_MASK                  (0x60000000U)
#define XRDC_B_PDAC_W1_LK2_SHIFT                 (29U)
#define XRDC_B_PDAC_W1_LK2_WIDTH                 (2U)
#define XRDC_B_PDAC_W1_LK2(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W1_LK2_SHIFT)) & XRDC_B_PDAC_W1_LK2_MASK)

#define XRDC_B_PDAC_W1_VLD_MASK                  (0x80000000U)
#define XRDC_B_PDAC_W1_VLD_SHIFT                 (31U)
#define XRDC_B_PDAC_W1_VLD_WIDTH                 (1U)
#define XRDC_B_PDAC_W1_VLD(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_B_PDAC_W1_VLD_SHIFT)) & XRDC_B_PDAC_W1_VLD_MASK)
/*! @} */

/*! @name XRDC_MRGD_W0 - Memory Region Descriptor Word 0 */
/*! @{ */

#define XRDC_B_XRDC_MRGD_W0_SRTADDR_MASK         (0xFFFFFFE0U)
#define XRDC_B_XRDC_MRGD_W0_SRTADDR_SHIFT        (5U)
#define XRDC_B_XRDC_MRGD_W0_SRTADDR_WIDTH        (27U)
#define XRDC_B_XRDC_MRGD_W0_SRTADDR(x)           (((uint32_t)(((uint32_t)(x)) << XRDC_B_XRDC_MRGD_W0_SRTADDR_SHIFT)) & XRDC_B_XRDC_MRGD_W0_SRTADDR_MASK)
/*! @} */

/*! @name XRDC_MRGD_W1 - Memory Region Descriptor Word 1 */
/*! @{ */

#define XRDC_B_XRDC_MRGD_W1_ENDADDR_MASK         (0xFFFFFFE0U)
#define XRDC_B_XRDC_MRGD_W1_ENDADDR_SHIFT        (5U)
#define XRDC_B_XRDC_MRGD_W1_ENDADDR_WIDTH        (27U)
#define XRDC_B_XRDC_MRGD_W1_ENDADDR(x)           (((uint32_t)(((uint32_t)(x)) << XRDC_B_XRDC_MRGD_W1_ENDADDR_SHIFT)) & XRDC_B_XRDC_MRGD_W1_ENDADDR_MASK)
/*! @} */

/*! @name XRDC_MRGD_W2 - Memory Region Descriptor Word 2 */
/*! @{ */

#define XRDC_B_XRDC_MRGD_W2_D0ACP_MASK           (0x7U)
#define XRDC_B_XRDC_MRGD_W2_D0ACP_SHIFT          (0U)
#define XRDC_B_XRDC_MRGD_W2_D0ACP_WIDTH          (3U)
#define XRDC_B_XRDC_MRGD_W2_D0ACP(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_XRDC_MRGD_W2_D0ACP_SHIFT)) & XRDC_B_XRDC_MRGD_W2_D0ACP_MASK)

#define XRDC_B_XRDC_MRGD_W2_D1ACP_MASK           (0x38U)
#define XRDC_B_XRDC_MRGD_W2_D1ACP_SHIFT          (3U)
#define XRDC_B_XRDC_MRGD_W2_D1ACP_WIDTH          (3U)
#define XRDC_B_XRDC_MRGD_W2_D1ACP(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_XRDC_MRGD_W2_D1ACP_SHIFT)) & XRDC_B_XRDC_MRGD_W2_D1ACP_MASK)

#define XRDC_B_XRDC_MRGD_W2_D2ACP_MASK           (0x1C0U)
#define XRDC_B_XRDC_MRGD_W2_D2ACP_SHIFT          (6U)
#define XRDC_B_XRDC_MRGD_W2_D2ACP_WIDTH          (3U)
#define XRDC_B_XRDC_MRGD_W2_D2ACP(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_XRDC_MRGD_W2_D2ACP_SHIFT)) & XRDC_B_XRDC_MRGD_W2_D2ACP_MASK)

#define XRDC_B_XRDC_MRGD_W2_D3ACP_MASK           (0xE00U)
#define XRDC_B_XRDC_MRGD_W2_D3ACP_SHIFT          (9U)
#define XRDC_B_XRDC_MRGD_W2_D3ACP_WIDTH          (3U)
#define XRDC_B_XRDC_MRGD_W2_D3ACP(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_XRDC_MRGD_W2_D3ACP_SHIFT)) & XRDC_B_XRDC_MRGD_W2_D3ACP_MASK)

#define XRDC_B_XRDC_MRGD_W2_D4ACP_MASK           (0x7000U)
#define XRDC_B_XRDC_MRGD_W2_D4ACP_SHIFT          (12U)
#define XRDC_B_XRDC_MRGD_W2_D4ACP_WIDTH          (3U)
#define XRDC_B_XRDC_MRGD_W2_D4ACP(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_XRDC_MRGD_W2_D4ACP_SHIFT)) & XRDC_B_XRDC_MRGD_W2_D4ACP_MASK)

#define XRDC_B_XRDC_MRGD_W2_D5ACP_MASK           (0x38000U)
#define XRDC_B_XRDC_MRGD_W2_D5ACP_SHIFT          (15U)
#define XRDC_B_XRDC_MRGD_W2_D5ACP_WIDTH          (3U)
#define XRDC_B_XRDC_MRGD_W2_D5ACP(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_B_XRDC_MRGD_W2_D5ACP_SHIFT)) & XRDC_B_XRDC_MRGD_W2_D5ACP_MASK)

